In [1]:
import pandas as pd
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

In [2]:
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
df.head()

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
import pandas as pd
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=['A', 'B', 'C'])

In [5]:
df.head()

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
df.head(1)

   A  B  C
0  1  2  3

In [7]:
df.tail(2)

   A  B  C
1  4  5  6
2  7  8  9

In [8]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
df.index.tolist()

[0, 1, 2]

In [11]:
import pandas as pd
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=['A', 'B', 'C'], index=['x', 'y', 'z'])

In [12]:
df

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [13]:
df.index

Index(['x', 'y', 'z'], dtype='object')

In [14]:
df.index.tolist()

['x', 'y', 'z']

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [16]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [17]:
df.nunique()

A    3
B    3
C    3
dtype: int64

In [18]:
df['A'].nunique()

3

In [19]:
df['A'].unique()

array([1, 4, 7])

In [20]:
df.shape

(3, 3)

In [21]:
df.size

9

In [74]:
food = pd.read_csv('food_prices.csv')

In [23]:
food.head()

     item store  price  Date
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017

In [24]:
food.sample(5) # random 5

     item store  price  Date
8   steak     B   4.99  2015
4  banana     A   0.39  2017
0    pear     A   0.99  2017
1    pear     B   1.99  2017
3   peach     B   3.49  2017

In [26]:
food.sample(5, random_state=1)

    item store  price  Date
8  steak     B   4.99  2015
2  peach     A   2.99  2017
6  steak     A   5.99  2017
7  steak     B   6.99  2017
1   pear     B   1.99  2017

In [27]:
food.loc(0)

In [28]:
food.loc[0]

item     pear
store       A
price    0.99
Date     2017
Name: 0, dtype: object

In [31]:
food.loc[[1, 3, 5]]

     item store  price  Date
1    pear     B   1.99  2017
3   peach     B   3.49  2017
5  banana     B   0.49  2017

In [32]:
food.loc[2:5]

     item store  price  Date
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017

In [34]:
food.loc[2:5, ['store']]

  store
2     A
3     B
4     A
5     B

In [35]:
food.loc[2:5, ['store', 'price']]

  store  price
2     A   2.99
3     B   3.49
4     A   0.39
5     B   0.49

In [36]:
food.loc[:, ['store', 'price']]

  store  price
0     A   0.99
1     B   1.99
2     A   2.99
3     B   3.49
4     A   0.39
5     B   0.49
6     A   5.99
7     B   6.99
8     B   4.99

In [37]:
food.iloc[[1, 2, 5], [1, 2]]

  store  price
1     B   1.99
2     A   2.99
5     B   0.49

In [38]:
food.index=food['item']

In [39]:
food

          item store  price  Date
item
pear      pear     A   0.99  2017
pear      pear     B   1.99  2017
peach    peach     A   2.99  2017
peach    peach     B   3.49  2017
banana  banana     A   0.39  2017
banana  banana     B   0.49  2017
steak    steak     A   5.99  2017
steak    steak     B   6.99  2017
steak    steak     B   4.99  2015

In [40]:
food.loc[['pear', 'banana'], 'store']

item
pear      A
pear      B
banana    A
banana    B
Name: store, dtype: object

In [41]:
food

          item store  price  Date
item
pear      pear     A   0.99  2017
pear      pear     B   1.99  2017
peach    peach     A   2.99  2017
peach    peach     B   3.49  2017
banana  banana     A   0.39  2017
banana  banana     B   0.49  2017
steak    steak     A   5.99  2017
steak    steak     B   6.99  2017
steak    steak     B   4.99  2015

In [42]:
food.loc['banana', 'store'] = 'C'

In [43]:
food

          item store  price  Date
item
pear      pear     A   0.99  2017
pear      pear     B   1.99  2017
peach    peach     A   2.99  2017
peach    peach     B   3.49  2017
banana  banana     C   0.39  2017
banana  banana     C   0.49  2017
steak    steak     A   5.99  2017
steak    steak     B   6.99  2017
steak    steak     B   4.99  2015

In [44]:
food.iat[0,0]

'pear'

In [45]:
food.sort_values('price')

          item store  price  Date
item
banana  banana     C   0.39  2017
banana  banana     C   0.49  2017
pear      pear     A   0.99  2017
pear      pear     B   1.99  2017
peach    peach     A   2.99  2017
peach    peach     B   3.49  2017
steak    steak     B   4.99  2015
steak    steak     A   5.99  2017
steak    steak     B   6.99  2017

In [46]:
food.sort_values('price', ascending=True)

          item store  price  Date
item
banana  banana     C   0.39  2017
banana  banana     C   0.49  2017
pear      pear     A   0.99  2017
pear      pear     B   1.99  2017
peach    peach     A   2.99  2017
peach    peach     B   3.49  2017
steak    steak     B   4.99  2015
steak    steak     A   5.99  2017
steak    steak     B   6.99  2017

In [47]:
food.sort_values(['price', 'store'], ascending=False)

          item store  price  Date
item
steak    steak     B   6.99  2017
steak    steak     A   5.99  2017
steak    steak     B   4.99  2015
peach    peach     B   3.49  2017
peach    peach     A   2.99  2017
pear      pear     B   1.99  2017
pear      pear     A   0.99  2017
banana  banana     C   0.49  2017
banana  banana     C   0.39  2017

In [48]:
food.sort_values(['price', 'store'], ascending=[0, 1])

          item store  price  Date
item
steak    steak     B   6.99  2017
steak    steak     A   5.99  2017
steak    steak     B   4.99  2015
peach    peach     B   3.49  2017
peach    peach     A   2.99  2017
pear      pear     B   1.99  2017
pear      pear     A   0.99  2017
banana  banana     C   0.49  2017
banana  banana     C   0.39  2017

In [49]:
for index, row in food.iterrows():
    print(index)
    print(row)
    print('\n\n')

pear
item     pear
store       A
price    0.99
Date     2017
Name: pear, dtype: object



pear
item     pear
store       B
price    1.99
Date     2017
Name: pear, dtype: object



peach
item     peach
store        A
price     2.99
Date      2017
Name: peach, dtype: object



peach
item     peach
store        B
price     3.49
Date      2017
Name: peach, dtype: object



banana
item     banana
store         C
price      0.39
Date       2017
Name: banana, dtype: object



banana
item     banana
store         C
price      0.49
Date       2017
Name: banana, dtype: object



steak
item     steak
store        A
price     5.99
Date      2017
Name: steak, dtype: object



steak
item     steak
store        B
price     6.99
Date      2017
Name: steak, dtype: object



steak
item     steak
store        B
price     4.99
Date      2015
Name: steak, dtype: object

In [50]:
for index, row in food.iterrows():
    print(index)
    print(row['price'])
    print('\n\n')

pear
0.99



pear
1.99



peach
2.99



peach
3.49



banana
0.39



banana
0.49



steak
5.99



steak
6.99



steak
4.99

In [51]:
food.loc[food['price']>0.1]

          item store  price  Date
item
pear      pear     A   0.99  2017
pear      pear     B   1.99  2017
peach    peach     A   2.99  2017
peach    peach     B   3.49  2017
banana  banana     C   0.39  2017
banana  banana     C   0.49  2017
steak    steak     A   5.99  2017
steak    steak     B   6.99  2017
steak    steak     B   4.99  2015

In [52]:
food.loc[food['price']>0.1, ['item', 'store']]

          item store
item
pear      pear     A
pear      pear     B
peach    peach     A
peach    peach     B
banana  banana     C
banana  banana     C
steak    steak     A
steak    steak     B
steak    steak     B

In [54]:
food.loc[food['price']>0.1][['item', 'store']]

          item store
item
pear      pear     A
pear      pear     B
peach    peach     A
peach    peach     B
banana  banana     C
banana  banana     C
steak    steak     A
steak    steak     B
steak    steak     B

In [55]:
food[food['price']>0.1]

          item store  price  Date
item
pear      pear     A   0.99  2017
pear      pear     B   1.99  2017
peach    peach     A   2.99  2017
peach    peach     B   3.49  2017
banana  banana     C   0.39  2017
banana  banana     C   0.49  2017
steak    steak     A   5.99  2017
steak    steak     B   6.99  2017
steak    steak     B   4.99  2015

In [56]:
food[(food['price']>0.1) & (food['store'] == 'A')]

        item store  price  Date
item
pear    pear     A   0.99  2017
peach  peach     A   2.99  2017
steak  steak     A   5.99  2017

In [57]:
food[food['item'].str.contains('pea')]

        item store  price  Date
item
pear    pear     A   0.99  2017
pear    pear     B   1.99  2017
peach  peach     A   2.99  2017
peach  peach     B   3.49  2017

In [61]:
food[food['item'].str.contains('Pea', case = False)]

        item store  price  Date
item
pear    pear     A   0.99  2017
pear    pear     B   1.99  2017
peach  peach     A   2.99  2017
peach  peach     B   3.49  2017

In [62]:
food[food['item'].str.contains('Pea|ba', case = False)]

          item store  price  Date
item
pear      pear     A   0.99  2017
pear      pear     B   1.99  2017
peach    peach     A   2.99  2017
peach    peach     B   3.49  2017
banana  banana     C   0.39  2017
banana  banana     C   0.49  2017

In [63]:
food[food['item'].str.contains('Pea|ba', case = False, regex=False)]

Empty DataFrame
Columns: [item, store, price, Date]
Index: []

In [64]:
food[food['item'].isin(['pear'])]

      item store  price  Date
item
pear  pear     A   0.99  2017
pear  pear     B   1.99  2017

In [67]:
food.query('price== 0.99 and item == "pear"')

      item store  price  Date
item
pear  pear     A   0.99  2017

In [68]:
import numpy as np

In [69]:
food['country'] = np.where(food['item'] == 'pear', 'USA', 'Uzb')

In [70]:
food

          item store  price  Date country
item
pear      pear     A   0.99  2017     USA
pear      pear     B   1.99  2017     USA
peach    peach     A   2.99  2017     Uzb
peach    peach     B   3.49  2017     Uzb
banana  banana     C   0.39  2017     Uzb
banana  banana     C   0.49  2017     Uzb
steak    steak     A   5.99  2017     Uzb
steak    steak     B   6.99  2017     Uzb
steak    steak     B   4.99  2015     Uzb

In [71]:
food.drop(columns=['item'])

       store  price  Date country
item
pear       A   0.99  2017     USA
pear       B   1.99  2017     USA
peach      A   2.99  2017     Uzb
peach      B   3.49  2017     Uzb
banana     C   0.39  2017     Uzb
banana     C   0.49  2017     Uzb
steak      A   5.99  2017     Uzb
steak      B   6.99  2017     Uzb
steak      B   4.99  2015     Uzb

In [72]:
food.drop(columns=['item'], inplace=True)

In [75]:
food

     item store  price  Date
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017
6   steak     A   5.99  2017
7   steak     B   6.99  2017
8   steak     B   4.99  2015

In [79]:
food = food.rename(columns={'block':'store'})

In [80]:
food

     item store  price  Date
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017
6   steak     A   5.99  2017
7   steak     B   6.99  2017
8   steak     B   4.99  2015

In [81]:
food_new = food.copy()

In [82]:
food_new

     item store  price  Date
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017
6   steak     A   5.99  2017
7   steak     B   6.99  2017
8   steak     B   4.99  2015